List islamStories = [
  {
    'title': 'قصّة سيدنا آدم',
    'content':
        'ذكر الله -تعالى- في كتابه العزيز قصّة خَلْق آدم -عليه السلام-؛ أوّل الأنبياء؛ فقد خَلَقه بيده على الصورة التي أرادها -سبحانه-، فكان مخلوقاً مُكرَّماً عن باقي المخلوقات، وخلق الله -سبحانه- ذريّة آدم على صورته وهيئته، قال -تعالى-: (وَإِذ أَخَذَ رَبُّكَ مِن بَني آدَمَ مِن ظُهورِهِم ذُرِّيَّتَهُم وَأَشهَدَهُم عَلى أَنفُسِهِم أَلَستُ بِرَبِّكُم قالوا بَلى شَهِدنا)،[١][٢] وبعد أن خلق الله آدم، أسكنه الجنّة مع زوجته حوّاء التي خُلِقت من ضِلْعه، فاستمتعا بنعيمها، باستثناء شجرة واحدةٍ نهاهم الله -سبحانه- عن الأكل منها، فوسوس لهما الشيطان؛ ليأكلا منها، فاستجابا لوساوسه، وأكلا من الشجرة حتى انكشفت عوراتهما، فسترا نفسيهما بورق الجنّة، وخاطب الله آدم مُعاتباً إيّاه على الأَكْل من تلك الشجرة بعد أن بيّن عداوة الشيطان له، وحذّره من اتِّباع وساوسه مرّةً أخرى، وقد أبدى آدم ندمه الشديد على فِعلته، وأظهر لله توبته، وأخرجهما الله من الجنّة، وأنزلهما إلى الأرض بأمره.[٣] كما ذكر الله -سبحانه- قصّة ابْنَي آدم -عليه السلام-، وهما: قابيل، وهابيل؛ فقد كانت من سُنّة آدم أن تتزوّج أنثى كلّ بطنٍ من ذكر البطن الآخر، فأراد قابيل أن يستأثر بأخته التي جاءت معه من البطن ذاتها؛ مَنْعاً لحَقّ أخيه فيما كتبه الله له، وحينما علم آدم -عليه السلام- بنيّة قابيل، طلب من كليهما أن يُقدّما قُرباناً لله، فتقبّل الله ما قدّمه هابيل، ممّا أثار غضب قابيل، فتوعّد أخاه بالقَتْل، قال -تعالى-: (وَاتْلُ عَلَيْهِمْ نَبَأَ ابْنَيْ آدَمَ بِالْحَقِّ إِذْ قَرَّبَا قُرْبَانًا فَتُقُبِّلَ مِنْ أَحَدِهِمَا وَلَمْ يُتَقَبَّلْ مِنَ الْآخَرِ قَالَ لَأَقْتُلَنَّكَ قَالَ إِنَّمَا يَتَقَبَّلُ اللَّـهُ مِنَ الْمُتَّقِينَ*لَئِن بَسَطتَ إِلَيَّ يَدَكَ لِتَقْتُلَنِي مَا أَنَا بِبَاسِطٍ يَدِيَ إِلَيْكَ لِأَقْتُلَكَ إِنِّي أَخَافُ اللَّـهَ رَبَّ الْعَالَمِينَ*إِنِّي أُرِيدُ أَن تَبُوءَ بِإِثْمِي وَإِثْمِكَ فَتَكُونَ مِنْ أَصْحَابِ النَّارِ وَذَلِكَ جَزَاءُ الظَّالِمِينَ*فَطَوَّعَتْ لَهُ نَفْسُهُ قَتْلَ أَخِيهِ فَقَتَلَهُ فَأَصْبَحَ مِنَ الْخَاسِرِينَ).[٤][٣]',
    'image': 'assets/images/adam.jpg'
  },
  {
    'title': 'قصّة سيدنا نوح',
    'content':
        'يُعَدّ نوح -عليه السلام- أوّل رسولٍ أُرسِل إلى الناس، وهو أحد أُولي العزم من الرُّسل؛ إذ لَبِثَ في دعوة قومه إلى توحيد الله ألف سنةٍ إلّا خمسين عاماً،[٧] ودعاهم إلى تَرْك عبادة الأصنام التي لا تملك لهم ضرّاً ولا نَفْعاً، وأرشدهم إلى عبادة الله وحده، وقد اجتهد نوح في دعوته، وسلك في تذكير قومه الأساليب والطُّرق جميعها؛ فدعاهم ليلاً ونهاراً، سرّاً وعلانيةً، فلم تُغنِ تلك الدعوة عنهم شيئاً؛ إذ قابلوها بالاستكبار والجحود، فكانوا يُغلقون آذانهم؛ لِئلّا يسمعوا دعوته، فَضْلاً عن اتّهامهم له بالكذب والجنون، ثمّ أوحى الله إلى نبيّه بصُنع السفينة، فصنعها رغم سُخرية المشركين من قومه منه، وانتظر أمر الله إليه بركوب السفينة مع مَن آمن بدعوته، بالإضافة إلى زوجيَن من كلّ نوعٍ من الكائنات الحيّة، ووقع ذلك بأمرٍ من الله حين فُتِحت السماء بالماء المُنهمِر الغزير، وتفجّرت الأرض ينابيع وعيوناً، فالتقى الماء على هيئةٍ عظيمةٍ، وطوفان مَهيبٍ أغرق القوم المُشركين بالله، ونُجِّيَ نوحٌ -عليه السلام- ومَن آمن معه.[٨]',
    'image': 'assets/images/noh.jpg'
  },
  {
    'title': 'قصّة سيدنا هود',
    'content':
        'أرسل الله -عزّ وجلّ- هوداً -عليه السلام- إلى قوم عادٍ الذين كانوا يسكنون في منطقةٍ تُسمّى الأحقاف؛ الجمع من حقف، ويُراد به: جبل الرَّمل، وقد تمثّلت الغاية من إرسال هود في دعوة عادٍ إلى عبادة الله، وتوحيده، وتَرْك الشِّرك وعبادة الأوثان، وتذكيرهم بالنِّعَم التي مَنَّ الله عليهم بها؛ من الأنعام، والبنين، والجِنان المُثمرة، وبما أنعم عليهم من الخلافة في الأرض من بعد قوم نوحٍ، وبيَّن لهم جزاء الإيمان بالله، وعاقبة الصدّ عنه، إلّا أنّهم قابلوا دعوته بالصدّ والاستكبار، فلم يستجيبوا رغم إنذار نبيّهم لهم، فعذّبهم الله جزاء شِركهم به؛ بأن أرسل عليهم رِيحاً شديدةً أهلكتهم، قال -تعالى-: (فَأَمَّا عَادٌ فَاسْتَكْبَرُوا فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَقَالُوا مَنْ أَشَدُّ مِنَّا قُوَّةً أَوَلَمْ يَرَوْا أَنَّ اللَّـهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً وَكَانُوا بِآيَاتِنَا يَجْحَدُونَ*فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي أَيَّامٍ نَّحِسَاتٍ لِّنُذِيقَهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةِ الدُّنْيَا وَلَعَذَابُ الْآخِرَةِ أَخْزَى وَهُمْ لَا يُنصَرُونَ).[٩][١٠]',
    'image': 'assets/images/hod.jpg'
  },
  {
    'title': 'قصّة سيدنا إبراهيم',
    'content':
        'عاش إبراهيم -عليه السلام- بين قومٍ يعبدون الأصنام من دون الله، وكان والده يصنعها ويبيعها للقوم، إلّا أنّ إبراهيم -عليه السلام- لم يتّبع ما كان عليه قومه، وأراد أن يبيّن لهم بطلان شِرْكهم، فبيَّت لهم دليلاً يُثبت لهم أنّ أصنامهم لا تضرّ ولا تنفع؛ ففي يوم خروجهم، حطّم إبراهيم -عليه السلام- أصنامهم جميعها إلّا صنماً كبيراً لهم؛ ليرجع القوم إليه، ويعلموا أنّها لا تضرّهم ولا تنفعهم، إلّا أنّهم أوقدوا النار؛ لإحراق إبراهيم -عليه السلام- حين علموا بما فعله بأصنامهم، فنجّاه الله منها، كما أقام عليهم الحُجّة أيضاً بإبطال ما كانوا يزعمون؛ بأنّ القمر، والشمس، والكواكب؛ لا تصلح للعبادة؛ إذ كانوا يطلقون تلك الأسماء على الأصنام، فبيّن لهم تدرّجاً أن العبادة لا تكون إلّا لخالق القمر والشمس والكواكب والسماوات والأرض.[٢٠] قال -تعالى- في بيان قصّة نبيّه إبراهيم: (وَلَقَد آتَينا إِبراهيمَ رُشدَهُ مِن قَبلُ وَكُنّا بِهِ عالِمينَ*إِذ قالَ لِأَبيهِ وَقَومِهِ ما هـذِهِ التَّماثيلُ الَّتي أَنتُم لَها عاكِفونَ*قالوا وَجَدنا آباءَنا لَها عابِدينَ*قالَ لَقَد كُنتُم أَنتُم وَآباؤُكُم في ضَلالٍ مُبينٍ*قالوا أَجِئتَنا بِالحَقِّ أَم أَنتَ مِنَ اللّاعِبينَ*قالَ بَل رَبُّكُم رَبُّ السَّماواتِ وَالأَرضِ الَّذي فَطَرَهُنَّ وَأَنا عَلى ذلِكُم مِنَ الشّاهِدينَ*وَتَاللَّـهِ لَأَكيدَنَّ أَصنامَكُم بَعدَ أَن تُوَلّوا مُدبِرينَ*فَجَعَلَهُم جُذاذًا إِلّا كَبيرًا لَهُم لَعَلَّهُم إِلَيهِ يَرجِعونَ*قالوا مَن فَعَلَ هـذا بِآلِهَتِنا إِنَّهُ لَمِنَ الظّالِمينَ*قالوا سَمِعنا فَتًى يَذكُرُهُم يُقالُ لَهُ إِبراهيمُ*قالوا فَأتوا بِهِ عَلى أَعيُنِ النّاسِ لَعَلَّهُم يَشهَدونَ*قالوا أَأَنتَ فَعَلتَ هـذا بِآلِهَتِنا يا إِبراهيمُ*قالَ بَل فَعَلَهُ كَبيرُهُم هـذا فَاسأَلوهُم إِن كانوا يَنطِقونَ*فَرَجَعوا إِلى أَنفُسِهِم فَقالوا إِنَّكُم أَنتُمُ الظّالِمونَ*ثُمَّ نُكِسوا عَلى رُءوسِهِم لَقَد عَلِمتَ ما هـؤُلاءِ يَنطِقونَ*قالَ أَفَتَعبُدونَ مِن دونِ اللَّـهِ ما لا يَنفَعُكُم شَيئًا وَلا يَضُرُّكُم*أُفٍّ لَكُم وَلِما تَعبُدونَ مِن دونِ اللَّـهِ أَفَلا تَعقِلونَ*قالوا حَرِّقوهُ وَانصُروا آلِهَتَكُم إِن كُنتُم فاعِلينَ*قُلنا يا نارُ كوني بَردًا وَسَلامًا عَلى إِبراهيمَ*وَأَرادوا بِهِ كَيدًا فَجَعَلناهُمُ الأَخسَرينَ).[٢١] لم يؤمن برسالة إبراهيم -عليه السلام- إلّا زوجته سارة وابن أخيه لوط -عليه السلام-، وقد رحل معهما متوجّهاً إلى حرّان، ثمّ إلى فلسطين، ثمّ إلى مصر، وتزوّج هناك من هاجر، وأنجب منها إسماعيل -عليه السلام-،[٢٠] ثمّ رُزق بإسحاق -عليه السلام- من زوجته سارة بعد أن أرسل الله -سبحانه- إليه ملائكة تُبشّره بذلك؛ قدرةً من الله -سبحانه- بعد أن بلَغا مَبلغاً من العُمر.',
    'image': 'assets/images/ibrahem.jpg',
  },
  {
    'title': 'قصّة سيدنا سليمان',
    'content':
        'كان سليمان بن داود -عليهما السلام- نبيّاً مَلكاً؛ فقد أتاه الله مُلكاً لا ينبغي لأحدٍ من بَعده، ومن مظاهر مُلكه أن أعطاه الله القدرة على فَهْم منطق الطير والحيوان، وتسخير الريح لتجريَ بأمره إلى المكان الذي يُريده، كما سخّر الله له الجِنّ، وكان جُلّ اهتمام نبيّ الله سليمان مُنصَبّاً على الدعوة إلى دين الله، وفي يومٍ من الأيّام افتقد وجود الهدهد في مجلسه، فتوعّده بسبب غيابه دون إذنه، ثمّ جاء الهدهد إلى مجلس سليمان، وأخبره أنّه كان ذاهباً في مَهمّةٍ، فوصل إلى بلدٍ رأى فيها العجب؛ فقد رأى قوماً تحكمُهم امرأةٌ اسمها بلقيس، ويعبدون الشمس من دون الله، فغضب سليمان حين سمع خبر الهدهد، فأرسل إليهم رسالةً تدعوهم إلى الإسلام والإذعان لأمر الله.[٤٦] تشاورت بلقيس مع أكابر قومها، ثمّ قرّرت إرسال وَفدٍ معه الهدايا إلى سليمان، فغضب سليمان من الهدايا؛ لأنّ الغاية الدعوة إلى توحيد الله، وليس استقبال الهدايا، فطلب من الوفد الرجوع، وإيصال رسالةٍ إلى بلقيس مُتوعِّداً إيّاها بجنودٍ عظيمةٍ تُخرجها وقومها من بلدتهم صاغرين، فقرّرت بلقيس الذهاب بمفردها إلى سليمان، فأراد سليمان قبل مجيئها أن يأتيَ بعَرْشها؛ ليُبيّن لها قدرة الله التي منحَها إيّاه، وأتى به رجلٌ مؤمنٌ، ثمّ جاءت بلقيس، ودخلت على سليمان، ولم تتعرّف على عرشها في بداية الأمر، ثمّ أعلمها سليمان بأنّه عرشها، فأسلمت مع سليمان لله ربّ العالَمين، ويُشار إلى أنّ سليمان -عليه السلام- تُوفِّي حينما كان قائماً يتعبّد، وكان مُتَّكِئاً على عصاه، فبقي على تلك الهيئة زماناً إلى أن أرسل الله حشرةً تأكل عصاه حتى سقط على الأرض، فأدرك الجِنّ أنّهم لو كانوا يعلمون الغيب ما استمرّوا في العمل طول المدّة التي كان فيها سليمان ميّتاً دون شعورهم.[٤٦] قال -تعالى-: (وَلِسُلَيْمَانَ الرِّيحَ غُدُوُّهَا شَهْرٌ وَرَوَاحُهَا شَهْرٌ وَأَسَلْنَا لَهُ عَيْنَ الْقِطْرِ وَمِنَ الْجِنِّ مَن يَعْمَلُ بَيْنَ يَدَيْهِ بِإِذْنِ رَبِّهِ وَمَن يَزِغْ مِنْهُمْ عَنْ أَمْرِنَا نُذِقْهُ مِنْ عَذَابِ السَّعِيرِ*يَعْمَلُونَ لَهُ مَا يَشَاءُ مِن مَّحَارِيبَ وَتَمَاثِيلَ وَجِفَانٍ كَالْجَوَابِ وَقُدُورٍ رَّاسِيَاتٍ اعْمَلُوا آلَ دَاوُودَ شُكْرًا وَقَلِيلٌ مِّنْ عِبَادِيَ الشَّكُورُ*فَلَمَّا قَضَيْنَا عَلَيْهِ الْمَوْتَ مَا دَلَّهُمْ عَلَى مَوْتِهِ إِلَّا دَابَّةُ الْأَرْضِ تَأْكُلُ مِنسَأَتَهُ فَلَمَّا خَرَّ تَبَيَّنَتِ الْجِنُّ أَن لَّوْ كَانُوا يَعْلَمُونَ الْغَيْبَ مَا لَبِثُوا فِي الْعَذَابِ الْمُهِينِ)',
    'image': 'assets/images/soliman.jpg',
  },
  {
    'title': 'قصّة سيدنا موسي',
    'content':
        'تعرّض بنو إسرائيل إلى مِحنةٍ شديدةٍ في بلاد مصر؛ حيث كان فرعون يُقتِّل أبناءهم عاماً، ويتركهم عاماً آخر، ويَستحيي نساءهم، وقد شاء الله أن تلد أمّ موسى في العام الذي يُقتَّل فيه الأولاد، فخَشِيت عليه من بَطْشهم، وفيما يأتي بيان ما حدث مع موسى -عليه السلام-:[٣١] موسى في التابوت: وضعت أمّ موسى وليدها في تابوتٍ، وقذفته في البحر؛ استجابةً لأمر الله -سبحانه وتعالى-، وقد وعدها الله -سبحانه- بردّه إليها، وأمرت أخته بتتبُّع أمره، وخَبَره. دخول موسى إلى قصر فرعون: شاء الله -سبحانه- أن تسير الأمواج بالتابوت إلى قصر فرعون، فالتقطه الخدم، ذاهبين بالتابوت إلى آسية زوجة فرعون، فكشفت عمّا في التابوت، فوجدت موسى -عليه السلام-، فقذف الله حبّه في قلبها، وعلى الرغم من أنّ فرعون همَّ بقَتله، إلّا أنّه تحوّل عن الأمر برجاءٍ من زوجته آسية، وقد حرّم الله عليه المراضع؛ فلم يقبل الرضاعة مِمّن في القصر، فخرجوا به إلى السوق باحثين عن مُرضعةٍ، فأخبرتهم أخته بمَن يصلح بذلك، وذهبت بهم إلى أمّه، وبذلك تحقّق وعد الله -سبحانه- بإرجاع موسى إليها. خروج موسى من مصر: خرج موسى -عليه السلام- من مصر بعد أن قتل رجلاً مصريّاً خطأً؛ نُصرةً لرجلٍ من بني إسرائيل، وكان قد توجّه إلى بلاد مَدْين. موسى في مدين: استظلّ موسى -عليه السلام- بشجرةٍ حين وصوله إلى مَدْين، ودعا ربّه الهداية إلى الطريق المستقيم، والصراط السويّ، ثمّ توجّه إلى بئر مَدْين، ووجد عنده فتاتَين تنتظران سقاية الماء لِما معهما من الأغنام، فسقى لهما، ثمّ استظلّ، ودعا ربّه بالرزق، وعادت الفتاتان إلى أبيهما، وأخبرتاه بما حصل معهما، فطلب من إحداهما الإتيان بموسى؛ ليشكره على صنيعه، فأتت به على استحياءٍ منها، واتّفق معه على الرَّعي له مدّة ثمان سنواتٍ، وإن زاد سنتَين فمن عنده، على أن يُزوّجه إحدى ابنتَيه، فوافق على ذلك. عودة موسى إلى مصر: عاد موسى -عليه السلام- إلى مصر بعد وفائه لعهده مع والد زوجته، وبحلول الليل أخذ يبحث عن نارٍ يستوقدها، إلّا أنّه لم يجد إلّا ناراً إلى جانب الجبل، فذهب إليها وحده تاركاً أهله، فناداه ربّه، وخاطبه، وأجرى على يدَيه معجزتَين؛ الأولى: تحوُّل العصا إلى ثعبانٍ، والثانية: خروج يده من جيبه بيضاء، فإن أرجعها عادت إلى حالتها الأولى، وأمره أن يذهب إلى فرعون مصر داعياً إيّاه إلى عبادة الله وحده، فطلب موسى من ربّه إعانته بأخيه هارون، فاستجاب له. دعوة موسى لفرعون: توجّه موسى مع أخيه هارون -عليهما السلام- إلى فرعون؛ لدعوته إلى توحيد الله، فأنكر فرعون دعوة موسى، وتحدّاه بسَّحَرَته، واتّفقا على موعدٍ يلتقي فيه الفريقان، فجمع فرعون السَّحَرة، وتحدّوا موسى -عليه السلام-، فثبتت حُجّة موسى، قال الله -تعالى-: (ثُمَّ بَعَثنا مِن بَعدِهِم موسى وَهارونَ إِلى فِرعَونَ وَمَلَئِهِ بِآياتِنا فَاستَكبَروا وَكانوا قَومًا مُجرِمينَ*فَلَمّا جاءَهُمُ الحَقُّ مِن عِندِنا قالوا إِنَّ هـذا لَسِحرٌ مُبينٌ*قالَ موسى أَتَقولونَ لِلحَقِّ لَمّا جاءَكُم أَسِحرٌ هـذا وَلا يُفلِحُ السّاحِرونَ*قالوا أَجِئتَنا لِتَلفِتَنا عَمّا وَجَدنا عَلَيهِ آباءَنا وَتَكونَ لَكُمَا الكِبرِياءُ فِي الأَرضِ وَما نَحنُ لَكُما بِمُؤمِنينَ*وَقالَ فِرعَونُ ائتوني بِكُلِّ ساحِرٍ عَليمٍ*فَلَمّا جاءَ السَّحَرَةُ قالَ لَهُم موسى أَلقوا ما أَنتُم مُلقونَ*فَلَمّا أَلقَوا قالَ موسى ما جِئتُم بِهِ السِّحرُ إِنَّ اللَّـهَ سَيُبطِلُهُ إِنَّ اللَّـهَ لا يُصلِحُ عَمَلَ المُفسِدينَ*وَيُحِقُّ اللَّـهُ الحَقَّ بِكَلِماتِهِ وَلَو كَرِهَ المُجرِمونَ).[٣٢] . نجاة موسى ومَن آمن معه: أمر الله -تعالى- نبيّه موسى -عليه السلام- أن يسير بقومه من بني إسرائيل ليلاً؛ هروباً من فرعون، وجمع فرعون جنوده وأتباعه؛ لحاقاً بموسى، إلّا أنّ فرعون غرق مع مَن معه.',
    'image': 'assets/images/mosa.jpg',
  },
];

List azkar = [
  {
    "دعاء الرعد": [
      {
        "ARABIC_TEXT":
            "((سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلاَئِكةُ مِنْ خِيفَتِهِ)).",
      }
    ],
    "أذكار النوم": [
      {
        "ARABIC_TEXT":
            "((يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيهِمَا فَيَقْرَأُ فِيهِمَا:بسم الله الرحمن الرحيم ﴿قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾.  بسم الله الرحمن الرحيم ﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾.  بسم الله الرحمن الرحيم ﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَ النَّاسِ﴾ ثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقبَلَ مِنْ جَسَدِهِ)) (يفعلُ ذلك ثلاثَ مرَّاتٍ)."
      },
      {
        "ARABIC_TEXT":
            "﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْـــــــــــدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾."
      },
      {
        "ARABIC_TEXT":
            "﴿آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لاَ يُكَلِّفُ اللَّهُ نَفْساً إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ﴾.",
      },
      {
        "ARABIC_TEXT":
            "((بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِن أَمْسَكْتَ نَفْسِي فارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ)).",
      },
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْياهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا. اللَّهُمَّ إِنِّي أَسْأَلُكَ العَافِيَةَ)).",
      },
      {
        "ARABIC_TEXT":
            " ((اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ)).",
      },
      {
        "ARABIC_TEXT": "((بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا)).",
      },
      {
        "ARABIC_TEXT":
            "((سُبْحَانَ اللَّهِ (ثلاثاً وثلاثين) وَالْحَمْدُ لِلَّهِ (ثلاثاً وثلاثين) وَاللَّهُ أَكْبَرُ (أربعاً وثلاثينَ))).",
      },
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ)).",
      },
      {
        "ARABIC_TEXT":
            "((الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لاَ كَافِيَ لَهُ وَلاَ مُؤْوِيَ)).",
      },
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ)).",
      },
      {
        "ARABIC_TEXT":
            "((يَقْرَأُ ﴿الم﴾ تَنْزِيلَ السَّجْدَة ِ،  وَتَبَارَكَ الَّذي بِيَدِهِ الْمُلْكُ)).",
      },
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ)).",
      }
    ],
    "دعاء الريح": [
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ إِنِّي أَسْــــــأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا)).",
      },
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيهَا، وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا فِيهَا، وَشَرِّ مَا أُرْسِلَتْ بِهِ)).",
      }
    ],
    "الدعاء للميت في الصلاة عليه": [
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعَافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ [وَعَذَابِ النَّارِ])).",
      },
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا، وَشَاهِدِنَا وَغَائِبِنَا، وَصَغِيرِنَا وَكَبيرِنَا، وَذَكَرِنَا وَأُنْثَانَا. اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الْإِسْلاَمِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيمَانِ، اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُ، وَلاَ تُضِلَّنَا بَعْدَهُ)).",
      },
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ إِنَّ فُلاَنَ بْنَ فُلاَنٍ فِي ذِمَّتِكَ، وَحَبْلِ جِوَارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ، وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ وَارْحَمْهُ إِنَّكَ أَنْتَ الغَفُورُ الرَّحيمُ)).",
      },
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ احْتَاجَ إِلَى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ فِي حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيئاً فَتَجَاوَزْ عَنْهُ)).",
      }
    ],
    "دعاء الهم والحزن": [
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُــــلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلاَءَ حُزْنِي، وَذَهَابَ هَمِّي)).",
      },
      {
        "ARABIC_TEXT":
            "((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ)).",
      }
    ],
    "دعاء الفزع في النوم و من بُلِيَ بالوحشة": [
      {
        "ARABIC_TEXT":
            "((أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّياطِينِ وَأَنْ يَحْضُرُونِ)).",
      }
    ],
    "دعاء الركوع": [
      {
        "ID": 33,
        "ARABIC_TEXT": "((سُبْحانَ رَبِّيَ الْعَظِيمِ)). ثلاث مرَّاتٍ.",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 3,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/33.mp3"
      },
      {
        "ID": 34,
        "ARABIC_TEXT":
            "((سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي)).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/34.mp3"
      },
      {
        "ID": 35,
        "ARABIC_TEXT":
            "((سُبُّوُحٌ، قُدُّوسٌ، رَبُّ المَلاَئِكَةِ وَالرُّوحِ)).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/35.mp3"
      },
      {
        "ID": 36,
        "ARABIC_TEXT":
            "((اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي، وَبَصَرِي، وَمُخِّي، وَعَــــظْمِي، وَعَصَبِي، [وَمَا استَقَلَّتْ بِهِ قَدَمِي])).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/36.mp3"
      },
      {
        "ID": 37,
        "ARABIC_TEXT":
            "((سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ)).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/37.mp3"
      }
    ],
    "أذكار الآذان": [
      {
        "ID": 22,
        "ARABIC_TEXT":
            " يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إِلاَّ فِي ((حَيَّ عَلَى الصَّلَاةِ وَحَيَّ عَلَى الْفَلَاحِ)) فَيقُولُ: ((لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ)).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/22.mp3"
      },
      {
        "ID": 23,
        "ARABIC_TEXT":
            " يَقُولُ: ((وَأَنَا أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، رَضِيتُ بِاللَّهِ رَبَّاً، وَبِمُحَمَّدٍ رَسُولاً، وَبِالْإِسْلاَمِ دِينَاً)) ((يَقُولُ ذَلِكَ عَقِبَ تَشَهُّدِ الْمُؤَذِّنِ)).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/23.mp3"
      },
      {
        "ID": 24,
        "ARABIC_TEXT":
            " ((يُصَلِّي عَلَى النَّبِيِّ صلى الله عليه وسلم بَعْدَ فَرَاغِهِ مِنْ إِجَابَةِ الْمُؤَذِّنِ)).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/24.mp3"
      },
      {
        "ID": 25,
        "ARABIC_TEXT":
            "يَقُولُ: ((اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاَةِ الْقَائِمَةِ، آتِ مُحَمَّداً الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَامَاً مَحمُوداً الَّذِي وَعَدْتَهُ، [إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ])).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/25.mp3"
      },
      {
        "ID": 26,
        "ARABIC_TEXT":
            "((يَدْعُو لِنَفسِهِ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ فَإِنَّ الدُّعَاءَ حِينَئِذٍ لاَ يُرَدُّ)).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/26.mp3"
      }
    ],
    "دعاء الذهاب إلى المسجد": [
      {
        "ID": 19,
        "ARABIC_TEXT":
            "(اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً، وَفِي لِسَانِي نُوراً، وَفِي سَمْعِي نُوراً، وَفِي بَصَرِي نُوراً، وَمِنْ فَوْقِي نُوراً، وَمِنْ تَحْتِي نُوراً، وَعَنْ يَمِينِي نُوراً، وَعَنْ شِمَالِي نُوراً، وَمِنْ أَمَامِي نُوراً، وَمِنْ خَلْفِي نُوراً، وَاجْعَلْ فِي نَفْسِي نُوراً، وَأَعْظِمْ لِي نُوراً، وَعَظِّم لِي نُوراً، وَاجْعَلْ لِي نُوراً، وَاجْعَلْنِي نُوراً، اللَّهُمَّ أَعْطِنِي نُوراً، وَاجْعَلْ فِي عَصَبِي نُوراً، وَفِي لَحْمِي نُوراً، وَفِي دَمِي نُوراً، وَفِي شَعْرِي نُوراً، وَفِي بَشَرِي نُوراً)([اللَّهُمَّ اجْعَلْ لِي نُوراً فِي قَبْرِي... وَنُوراً فِي عِظَامِي])[(وَزِدْنِي نُوراً، وَزِدْنِي نُوراً، وَزِدْنِي نُوراً)][(وَهَبْ لِي نُوراً عَلَى نُورٍ)]",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/19.mp3"
      }
    ],
    "الذكر عند الخروج من المنزل": [
      {
        "ID": 16,
        "ARABIC_TEXT":
            "(بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَاَ حَوْلَ وَلَا قُوَّةَ إِلاَّ بِاللَّهِ).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/16.mp3"
      },
      {
        "ID": 17,
        "ARABIC_TEXT":
            "(اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/17.mp3"
      }
    ],
    "دعاء دخول الخلاء": [
      {
        "ID": 10,
        "ARABIC_TEXT":
            "([بِسْمِ اللَّهِ] اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبائِث).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/10.mp3"
      }
    ],
    "أذكار الاستيقاظ من النوم": [
      {
        "ID": 1,
        "ARABIC_TEXT":
            "( الْحَمْدُ للَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُورُ )",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/1.mp3"
      },
      {
        "ID": 2,
        "ARABIC_TEXT":
            "( لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَريكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالْحَمْدُ للَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفرْ لِي ).",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/2.mp3"
      },
      {
        "ID": 3,
        "ARABIC_TEXT":
            "( الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لي بِذِكْرِهِ )",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/3.mp3"
      },
      {
        "ID": 4,
        "ARABIC_TEXT":
            "﴿ إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لأُوْلِي الألْبَابِ * الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَاماً وَقُعُوداً وَعَلَىَ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ* رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ* رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِياً يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ* رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ* فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لاَ أُضِيعُ عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَى بَعْضُكُم مِّن بَعْضٍ فَالَّذِينَ هَاجَرُواْ وَأُخْرِجُواْ مِن دِيَارِهِمْ وَأُوذُواْ فِي سَبِيلِي وَقَاتَلُواْ وَقُتِلُواْ لأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلأُدْخِلَنَّهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ ثَوَاباً مِّن عِندِ اللَّهِ وَاللَّهُ عِندَهُ حُسْنُ الثَّوَابِ * لاَ يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُواْ فِي الْبِلاَدِ * مَتَاعٌ قَلِيلٌ ثُمَّ مَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمِهَادُ * لَكِنِ الَّذِينَ اتَّقَوْاْ رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا نُزُلاً مِّنْ عِندِ اللَّهِ وَمَا عِندَ اللَّهِ خَيْرٌ لِّلأَبْرَارِ * وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَن يُؤْمِنُ بِاللَّهِ وَمَا أُنزِلَ إِلَيْكُمْ وَمَآ أُنزِلَ إِلَيْهِمْ خَاشِعِينَ لِلَّهِ لاَ يَشْتَرُونَ بِآيَاتِ اللَّهِ ثَمَناً قَلِيلاً أُوْلَئِكَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ*يَا أَيُّهَا الَّذِينَ آمَنُواْ اصْبِرُواْ وَصَابِرُواْ وَرَابِطُواْ وَاتَّقُواْ اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ ﴾",
        "LANGUAGE_ARABIC_TRANSLATED_TEXT": "",
        "TRANSLATED_TEXT": "",
        "REPEAT": 1,
        "AUDIO": "http://www.hisnmuslim.com/audio/ar/4.mp3"
      }
    ],
  }
];

List sunnah = [
  {
    "سنن النبي في الوضوء": [
      'كان النبي يبدأ وضوءه بالتسمية *',
      'يستاك قبل أن يتوضأ *',
      'يقوم بغسل الكفين إلى الرسغين ثلاث مرات وبين الأصابع *',
      'يتمضمض ويستنشق قبل أن يغسل وجهه *',
      'عندما يغسل وجهه فإنه يُخَلِّل اللحية بدلكها بالماء في لحيته حيث كانت كثيفة *',
      'عند الغُسل يبدأ باليمنى قبل اليسرى، ويكرر ذلك ثلاث مرات، ثم يمسح رأسه، وأذنيه *',
      'يقوم بالدعاء بعد أن يتوضأ ثم يصلي ركعتين *'
    ],
    "سنن النبي في الصلاة": [
      'النيّة والخشوع في الصلاة *',
      'نرفع اليدين بمستوى الأذنين عند التكبير *',
      'وضع اليد اليمنى على اليد اليسرى في الفروض، كما تكون القدمين متوسطة الفتحة عند القيام بالانفراج والانقباض *',
      'قراءة آياتٍ أو سورة قصيرة من القرآن بعد الفاتحة *',
      'تكون الركعة الثانية أقصر من الركعة الأولى *',
      'نقول التأمين بعد قوله تعالى: ولا الضالّين فنرد :آمين سرًّا في الصلاة السرية، وجهراً في الصلاة الجهرية *',
      'استواء العنق والظهر عند الركوع ويكون الرأس مستقيم لا مرفوع ولا منتكس، توضع اليدين على الركبتين، ويتم تفريق الأصابع، تكون الركبتين منتصبتان *',
      'يجب على الرجل أن يباعد مرفقيه عن جنبيه، أما المرأة تضمهما إليها، مع قول “سبحان ربي العظيم” ثلاث مرات *',
      'قول “سمع الله لمن حمده” عند القيام من الركوع، وقول “ربنا ولك الحمد” عند الاستواء *',
      'الاعتماد على الأرض عند السجود، وجعل الأنف والجبهة يصلوا إليها ونقوم بالسجود على الركبتين والكفين وباطن أطراف القدمين، وجعل الركبتين هما أول من ينزل للسجود ثم اليدين، أما في القيام للركعة التالية فيجب تقديم اليدين على الركبتين *',
      'إبعاد الرجل بطنه عن فخذيه، وركبتيه عن مرفقيه في السجود، أما المرأة فتضمُّ نفسها، وتُسبح في السجود بقول “سبحان ربي الأعلى”، ثم الدُّعاء *',
      'التورك عند السجود للمرأة والرجل، في التشهد الأول الجلوس يكون أقصر من مدة الجلوس في التشهد الثاني، ونضع اليدين في مقدمة الفخذين من جلوس إلى جلوس عند التشهدين، ونرفع سبابة اليد اليمنى عند التشهد *',
      'ندعي عند الانتهاء من الصلاة الإبراهيمية وقبل السلام، ثم نسلم من اليمين وبعد ذلك الشمال *',
      'نقرأ آية الكرسي وسورة الإخلاص بعد أن ننتهي من الصلاة ونسبح ثلاث وثلاثون، و نحمد ثلاث وثلاثون، ونكبر ثلاث وثلاثون، ثم نختمها بالتشهد، ثم الاستغفار *',
    ],
    "سنن النبي عند النوم": [
      'النوم على وضوء كما قال النبي (إذا أتيت مضجعك، فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن) *',
      'قراءة سورة الإخلاص والمعوذتين قبل النوم، حيث وُرد عن عائشة رضي الله عنها قالت أن النبي “صلى الله عليه وسلم” كان إذا أوى إلى فراشه كل ليلة جمع كفيه ثم نفث فيهما، فقرأ فيهما: (قل هو الله أحد) و (قل أعوذ برب الفلق) و (قل أعوذ برب الناس)، ثم يمسح بهما ما استطاع من جسده، فيبدأ بهما على رأسه ووجهه، وما أقبل من جسده، يفعل ذلك ثلاث مرات *',
      'التكبير والتسبيح عند المنام: حيث رُويّ عن علي رضي الله عنه، أن رسول الله “صلى الله عليه وسلم” قال حين طلبت منه فاطمة رضي الله عنها خادمًا:(ألا أدلكما على ما هو خير لكما من خادم ؟ إذا أويتما إلى فراشكما، أو أخذتما مضاجعكما، فكبرا أربعًا وثلاثين، وسبحا ثلاثًا وثلاثين، واحمدا ثلاثًا وثلاثين، فهذا خير لكما من خادم) *',
    ],
    "سنن النبي عند الاستيقاظ": [
      'الدعاء حين الاستيقاظ خلال النوم، فقد رويَّ عن عبادة بن الصامت رضي الله عنه، عن النبي صلى الله عليه وسلم قال: (من تعارَّ من الليل فقال: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، الحمد لله، وسبحان الله، والله أكبر، ولا حول ولا قوة إلا بالله، ثم قال: اللهم اغفر لي، أو دعا، استُجيب له، فإنْ توضأ وصلى قُبِلت صلاته) *',
      'الدعاء عند الاستيقاظ من النوم بهذا الدعاء: (الحمد لله الذي أحيانا بعد ما أماتنا، وإليه النشور) *',
      'من سنن الرسول صلى الله عليه وسلم أيضًا أن تبدأ يومك ببسم الله وأن تغسل يدك ثلاث قبل أن تأكل وتُيمن وتتوضأ على السنة ثم صلي كما قال النبي صلى الله عليه وسلم (إذا استيقظ أحدكم فلا يدخل يده في الإناء حتى يغسلها) *',
    ],
    "سنن الرسول التعاملات اليومية": [
      'البدء بالسلام عند مقابلة أحد الأفراد *',
      'كن سمحًا في شرائك وبيعك وقضائك، فقد قال صلى الله عليه وسلم: (رحم الله رجلاً سمحًا إذا باع وإذا اشترى وإذا اقتضى) *',
      'كن مُسامحًا حليمًا عفوًا لمن أساء إليك ولا تغضب *',
      'إن حضرت جنازة صلي عليها وقم باتباعها إن أمكن لقوله صلى الله عليه وسلم: (من صلى على جنازة كان له قيراطان) *',
      'عندما تمر بمقابر المسلمين، سلم واسأل الله لك ولهم العافية *',
      'إن رجعت من سفر متأخرًا ليلاً لا تطرق أهلك *',
      'كن خير لأهلك لقوله صلى الله عليه وسلم: (خيركم خير لأهله وأنا خيركم لأهلي) *',
    ],
    "سنن الرسول المهجورة": [
      'المضمضة والاستنشاق بغرفة واحدة *',
      'التشهّد والدعاء بعد الانتهاء من الوضوء *',
      'صلاة ركعتين بعد الوضوء؛ كما ورد في هذا الحديث: (مَن تَوَضَّأَ نَحْوَ وُضُوئِي هذا ثُمَّ قامَ فَرَكَعَ رَكْعَتَيْنِ لا يُحَدِّثُ فِيهِما نَفْسَهُ غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ) *',
      'الوضوء قبل الغسل، وقد ورد ذلك في فعل النبي عليه الصلاة والسلام، حيث قالت عائشة رضي الله عنها: (كانَ إذَا اغْتَسَلَ مِنَ الجَنَابَةِ، بَدَأَ فَغَسَلَ يَدَيْهِ، ثُمَّ يَتَوَضَّأُ كما يَتَوَضَّأُ لِلصَّلَاةِ) *',
      'هناك الكثير من سنن الرسول صلى الله عليه وسلم المهجورة في الملبس والصلاة والوضوء والصوم وغيرها *',
    ],
    "تعامل الرسول مع أهل بيته": [
      'كان النبي يعامل أهل بيته بالأخلاق الحسنة فكان يلاطف الصغير والكبير، ويعمل على خدمة أهل بيته وخدمة نفسه، كما كان عليه الصلاة والسلام يتعامل مع زوجاته بقدر رجاحة العقل والحكمة التي تملكها كل منهم *'
          'كان يسابق ويداعب زوجاته كما كان يفعل مع السيدة عائشة رضي الله عنها، وعندما يقدم إليه الطعام فإنه يعبر عن كيف أنه اشتهاه ولا يعيبه، بالغضافة إلى أنه لم يكن كثير الغضب إلا عندما يرى حرمات الله يتم انتهاكها فيثور غضبه غيرةً على دينه *',
      'كان ينادي زوجاته بأحب الأسماء إليهم، حيث كان ينادي عائشة رضي الله عنها فيقول: (يا عائِشَ هذا جِبْرِيلُ يُقْرِئُكِ السَّلامَ) *',
    ],
    "تعامل الرسول مع أصحابه": [
      'كان النبي صلى الله عليه وسلم يعاملهم معاملة طيبة وعندما يخطئ أحد منهم كان يظهر العفو والرفق، وكان يهتم بمشورتهم في أمور كثيرة ويقوي عزيمتهم، وكان يمازحهم ويشاركهم في الطعام *',
      'كما كان لا يخجل من إظهار حبه لهم ووصفهم بصفات مختلفة، وكان ذلك يزيد من المحبة بينهم، على سبيل المثال كان يصف الزبير بن العوام بأنه حواريّه، ويصف أبو بكر وعمر بن الخطاب أنهما وزيراه، ويصف عامر بن الجراح بأنه أمين الأمّة *',
      'كان النبي صلى الله عليه وسلم يراعي ظروف أصحابه النفسية ويحاول أن يرفع من هممهم ويشاركهم فرحهم وحزنهم، وكان يحرص على أن يشاركهم آلامهم ومعاناتهم ويعمل على إسعادهم *',
    ],
    "تعامل النبي مع أعدائه": [
      'قد قام النبي صلى الله عليه وسلم بوضع ميثاق بالمدينة لينظم العلاقة بين الأنصار والمهاجرين من المسلمين وبين اليهود حتى يعم السلام بينهم وأصبحوا قوة تصد الأعداء عن المدينة *',
      'عندما كان يتواجد أسرى من المشركين فإن الرسول كان يوصي بهم خيرًا كما قد فعل مع أسرى بدر، قد كان يزور جاره اليهودي المريض وقد دعاه للإسلام وقد دخل الإسلام بالفعل واهتدى على يد رسول الله، وخرج رسول الله من عنده يحمد الله تعالى بأنه أنقذه من النار *',
    ],
    "سنن الرسول للاطفال": [
      'يجب تعليمهم آداب الطعام، مثل البسملة قبل البدء في الطعام والأكل مما يليهم وتناول الطعام باليد اليمنى، وحمد الله بعد الانتهاء من الطعام، مع التنويه على عدم ملء البطن بكمية كثيرة من الطعام، حتى لا يصابوا بأضرار صحية *',
      'تعليمهم كيفية الوضوء والصلاة والخشوع لله في صلاتهم وكيفية الدعاء إلى الله وأهميته *',
      'السنن والنوافل في الصلاة *',
      'الصوم في رمضان حيث إنه فريضة بالإضافة إلى الصيام في بعد الأيام المستحبة الأخرى *',
      'من سنن الرسول صلى الله عليه وسلم المهجورة تعليم الأطفال مساعدة الغير ومد العون له، مما ينمي لديهم روح المساعدة والعطف، وكذلك إطعام الفقراء والعطف عليهم *',
      'النوم على الشق الأيمن وذكر الله قبل النوم وعند الاستيقاظ من النوم *',
      'المداومة على التسابيح وأذكار الصباح والمساء، ومحاولة الاستمرار على قراءة ورد يومي من القرآن الكريم *',
      'كما أنه من سنن الرسول صلى الله عليه وسلم التي يجب تعليمها للأطفال هو تقديم المشيئة في أي عمل ينوي الطفل القيام به *',
    ],
  }
];

List messages = [
  'إِنَّ الْمُصَّدِّقِينَ وَالْمُصَّدِّقَاتِ وَأَقْرَضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعَفُ لَهُمْ وَلَهُمْ أَجْرٌ كَرِيمٌ ',
  'وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ',
  'وَاتَّقُوا يَوْمًا لَّا تَجْزِي نَفْسٌ عَن نَّفْسٍ شَيْئًا وَلَا يُقْبَلُ مِنْهَا شَفَاعَةٌ وَلَا يُؤْخَذُ مِنْهَا عَدْلٌ وَلَا هُمْ يُنصَرُونَ',
  'وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مِنْ أَمْرِهِ يُسْرًا',
  'وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ',
  'فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ',
  'ادْعُوا رَبَّكُمْ تَضَرُّعًا وَخُفْيَةً إِنَّهُ لَا يُحِبُّ الْمُعْتَدِينَ',
  'الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ',
  'وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِنَ الْأَمْوَالِ وَالْأَنْفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ * الَّذِينَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ',
  'هُوَ الّذِيَ أَنزَلَ السّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ لِيَزْدَادُوَاْ إِيمَاناً مّعَ إِيمَانِهِمْ وَلِلّهِ جُنُودُ السّمَاوَاتِ وَالأرْضِ وَكَانَ اللّهُ عَلِيماً حَكِيماً',
  'وَقَالُواْ الْحَمْدُ للّهِ الّذِيَ أَذْهَبَ عَنّا الْحَزَنَ إِنّ رَبّنَا لَغَفُورٌ شَكُورٌ',
  'وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاء وَرَحْمَةٌ لِّلْمُؤْمِنِينَ وَلاَ يَزِيدُ الظَّالِمِينَ إَلاَّ خَسَارًا',
  ' رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ',
  'إِذَا جَاءَكَ الَّذِينَ يُؤْمِنُونَ بِآيَاتِنَا فَقُلْ سَلَامٌ عَلَيْكُمْ ۖ كَتَبَ رَبُّكُمْ عَلَىٰ نَفْسِهِ الرَّحْمَةَ ۖ أَنَّهُ مَنْ عَمِلَ مِنكُمْ سُوءًا بِجَهَالَةٍ ثُمَّ تَابَ مِن بَعْدِهِ وَأَصْلَحَ فَأَنَّهُ غَفُورٌ رَّحِيمٌ',
  'وَاصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا وَسَبِّحْ بِحَمْدِ رَبِّكَ حِينَ تَقُومُ ',
  'فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانتَصِرْ',
  'وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ * فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُنْ مِنَ السَّاجِدِينَ * وَاعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ',
];
